from 던파API파싱하기 import *
from 캐릭터정보 import *
from myTk import *

기준캐릭터 = None
측정캐릭터 = None

고인물전투력 = {'독립공격력' : 762652.38, "물리공격력" : 7623841.0, "마법공격력" : 7623841.0}
노오력전투력 = {'독립공격력': 146841.49, "물리공격력": 1466123.27, "마법공격력" : 1466123.27}
퀘전전투력 = {'독립공격력': 20583.06, "물리공격력": 206496.24, "마법공격력" : 206496.24}

class 던파스카우터프레임워크:
    def __init__(self):
        self.Tk_Position = {'x' : 600, 'y' : 150}
        self.AppState = '메뉴' #'기본캐릭터불러오기' # '측정캐릭터불러오기' # '측정캐릭아이템변경 #측정캐릭터측정하기
        self.Scene = None
        self.메뉴Tk()

        self.__loopFlag = True
        self.__xmlFD = -1
        self.__찾는서버 = None
        self.__찾는이름 = None

    def 캐릭터불러오기(self):
        캐릭터불러오기_Tk = Tk()
        캐릭터불러오기_Tk.geometry(Tk크기설명(400, 210, self.Tk_Position['x'] - 100, self.Tk_Position['y']))

        global 불러오는캐릭터타입
        불러오는캐릭터타입 = None

        string = ''
        출력창 = None

        Tk글쓰기(캐릭터불러오기_Tk, 20, 'bold', '[던파스카우터]', 100, 10)
        Tk글쓰기(캐릭터불러오기_Tk, 15, 'bold', '서버', 0, 60)

        서버리스트 = ['카인', '디레지에', "시로코",
                 '프레이', '카시야스', '힐더',
                 '안톤', '바칼']
        서버리스트박스 = Tk리스트박스만들기(캐릭터불러오기_Tk, 15, 'bold', 서버리스트, 50, 60)

        Tk글쓰기(캐릭터불러오기_Tk, 15, 'bold', '이름', 0, 90)
        입력창 = Tk입력창만들기(캐릭터불러오기_Tk, 12, 'bold', 15, 50, 90)

        def 측정():
            global 불러오는캐릭터타입
            불러오는캐릭터타입 = '측정'

        def 기준():
            global 불러오는캐릭터타입
            불러오는캐릭터타입 = '기준'

        Tk라디오버튼만들기(캐릭터불러오기_Tk, '측정', 1, 측정, 120, 180)
        라디오버튼 = Tk라디오버튼만들기(캐릭터불러오기_Tk, '기준', 0, 기준, 120, 160)

        def 불러오기():
            global 불러온캐릭터
            index = int(서버리스트박스.yview()[0] * 8)
            불러온캐릭터 = 캐릭터정보()
            불러온캐릭터.캐릭터가져오기(서버리스트박스.get(index), 입력창.get())
            string = '이름 : ' + 불러온캐릭터.이름 + '\n'
            string += '직업 : ' + 불러온캐릭터.직업
            출력창 = Tk출력창만들기(캐릭터불러오기_Tk, 10, 25, 10, string, 215, 70)

        def 저장하기():
            global 불러오는캐릭터타입
            global 불러온캐릭터
            global 측정캐릭터
            global 기준캐릭터
            if 불러오는캐릭터타입 == '측정':
                측정캐릭터 = 불러온캐릭터

            else:
                기준캐릭터 = 불러온캐릭터

            출력창 = Tk출력창만들기(캐릭터불러오기_Tk, 10, 25, 10, '저장되었습니다.', 215, 70)

        def 돌아가기():
            self.메뉴Tk()

        Tk버튼만들기(캐릭터불러오기_Tk, 12, 'bold', '불러오기', 불러오기, 20, 125)
        Tk버튼만들기(캐릭터불러오기_Tk, 12, 'bold', '저장하기', 저장하기, 110, 125)
        Tk버튼만들기(캐릭터불러오기_Tk, 12, 'bold', '돌아가기', self.메뉴Tk, 20, 165)

        Tk글쓰기(캐릭터불러오기_Tk, 12, 'bold', '불러오기결과', 250, 47)

        출력창 = Tk출력창만들기(캐릭터불러오기_Tk, 10, 25, 10, '불러온 캐릭터가 없습니다.', 215, 70)

        if self.Scene != None:
            self.Scene.destroy()

        self.Scene = 캐릭터불러오기_Tk


    def 전투력측정하기(self):
        전투력측정하기_Tk = Tk()
        전투력측정하기_Tk.geometry(Tk크기설명(440, 500, self.Tk_Position['x'] - 150, self.Tk_Position['y']))

        Tk글쓰기(전투력측정하기_Tk, 20, 'bold', '[던파스카우터 : 전투력측정하기]', 0, 0)

        Tk글쓰기(전투력측정하기_Tk, 12, 'bold', '공격 타입', 25, 40)
        공격타입리스트 = ['물리공격력', '마법공격력', '독립공격력']
        공격타입리스트박스 = Tk리스트박스만들기(전투력측정하기_Tk, 12, 'bold', 공격타입리스트, 110, 40)

        Tk글쓰기(전투력측정하기_Tk, 12, 'bold', '측정 타입', 25, 70)
        측정타입리스트 = ['퀘전', '노력', '모인물', '기준캐릭']
        측정타입리스트박스 = Tk리스트박스만들기(전투력측정하기_Tk, 12, 'bold', 측정타입리스트, 110, 70)

        def 측정하기():
            공격타입 = 공격타입리스트박스.get(int(공격타입리스트박스.yview()[0] * len(공격타입리스트)))
            측정타입 = 측정타입리스트박스.get(int(측정타입리스트박스.yview()[0] * len(측정타입리스트)))
            global 측정캐릭터
            global 퀘전전투력
            global 노오력전투력
            global 고인물전투력

            측정하기String = '이름 : ' + 측정캐릭터.이름
            측정하기String += '직업 : ' + 측정캐릭터.직업

            if 측정타입 == '퀘전':
                측정하기String = '전투력 : ' + str(int(측정캐릭터.전투력계산(공격타입) / 퀘전전투력[공격타입] * 100)/100) + '퀘전'

            elif 측정타입 == '노력':
                측정하기String = '전투력 : ' + str(int(측정캐릭터.전투력계산(공격타입) / 노오력전투력[공격타입] * 100) / 100) + '노력'

            elif 측정타입 == '모인물':
                측정하기String = '전투력 : ' + str(int(측정캐릭터.전투력계산(공격타입) / 고인물전투력[공격타입] * 100) / 100) + '모인물'

            elif 측정타입 == '기준캐릭':
                측정하기String = '전투력 : ' + str(int(측정캐릭터.전투력계산(공격타입) / 퀘전전투력[공격타입] * 100) / 100) + '퀘전'
            else:
                측정하기String = "dpqpqpqpqp"

            string = ''
            #if 측정캐릭터 == None:
                #string = '측정하고자할 캐릭터가 존재하지 않습니다.'

            출력창 = Tk출력창만들기(전투력측정하기_Tk, 10, 54, 28, 측정하기String, 30, 110)

        Tk버튼만들기(전투력측정하기_Tk, 12, 'bold', '측정하기', 측정하기, 260, 40)

        Tk버튼만들기(전투력측정하기_Tk, 12, 'bold', '돌아가기', 돌아가기, 340, 40)

        출력창 = Tk출력창만들기(전투력측정하기_Tk, 10, 54, 28, '저장되었습니다.', 30, 110)



        if self.Scene != None:
            self.Scene.destroy()

        self.Scene = 전투력측정하기_Tk

    def 메뉴Tk(self):
        메뉴_Tk = Tk()
        메뉴_Tk.geometry(Tk크기설명(200, 270, self.Tk_Position['x'], self.Tk_Position['y']))
        Tk글쓰기(메뉴_Tk, 20, 'bold', '[던파스카우터]', 0, 10)
        Tk버튼만들기(메뉴_Tk, 15, 'bold', '캐릭터불러오기', self.캐릭터불러오기, 20, 60)
        Tk버튼만들기(메뉴_Tk, 15, 'bold', '캐릭터설정하기', None, 20, 100)
        Tk버튼만들기(메뉴_Tk, 15, 'bold', '전투력측정하기', self.전투력측정하기, 20, 140)
        Tk버튼만들기(메뉴_Tk, 15, 'bold', '     메일    ', None, 20, 180)
        Tk버튼만들기(메뉴_Tk, 15, 'bold', '     종료    ', self.종료, 20, 220)
        if (self.Scene != None):
            self.Scene.destroy()

        self.Scene = 메뉴_Tk




    def 캐릭터설정하기(self):
        pass


    def 메일(self):
        pass

    def 종료(self):
        self.Scene.destroy()



    
    def __측정_캐릭터_설정하기(self):
        pass


    def 실행하기(self):
        self.Scene.mainloop()


fw = 던파스카우터프레임워크()
fw.실행하기()