
세트아이템_2 = {
    '바이라바의 계승자' : '공격 시 데미지 증가량 12% 추가 증가 공격 시 크리티컬 데미지 증가량 12% 추가 증가'
}

세트아이템_3 ={
    '바이라바의 계승자' : '힘, 지능 12% 증가 장착 시 이동속도 +7%, 공격속도 +7%, 캐스팅속도 +10% 증가(장착 해제 시 옵션이 해제됩니다.)'
    ,'헤블론의 군주 세트' : '헤블론의 어둠의 영광 : 스킬 공격력 20% 증가'
    ,'오감의 황홀경 세트' :  "크리티컬 공격 시 데미지 20% 증가 공격 시 데미지 20% 증가\
                            공격 시 30초동안 공격속도 10% 증가\
                            캐스팅시 30초동안 캐스팅속도 12% 증가\
                            대쉬 시 30초동안 이동속도 10% 증가\
                            모든 속성 저항 +30"
    ,'하늘의 여행자 세트' :  '공격 시 30% 추가 데미지'
    ,'타락의 칠죄종 세트' : '크리티컬 공격 시 데미지 증가량 25%'
    ,'나가라자의 탐식 세트' : '모든 공격력 25% 증가'
    ,'초대륙의 붕괴 세트' : '공격 시 22% 추가 데미지'
    ,'핀드 베나토르 세트' : '물리, 마법, 독립 공격력 10% 증가'
    ,'게슈펜스트의 환각 세트':'힘 20%, 지능 20% 증가'
    ,'센츄리온 히어로 세트' : '공격 시 25% 추가 데미지'
    ,'고대전쟁의 여신 세트' : '모든 직업 50 레벨 스킬 Lv +3 모든 공격력 22% 증가'
    ,'찬란한 명예의 상징 세트' : '공격 시 15% 추가 데미지'
    ,'마계의 정중한 신사 세트' : '공격 시 데미지 증가량 20% 추가 증가 힘 5%, 지능 5% 증가'
    ,'오기일의 꽃 세트' : '물리, 마법, 독립 공격력 10% 증가'

    }


세트아이템_5 ={
    '타락의 칠죄종 세트' : '스킬 공격력 35% 증가'
    ,'나가라자의 탐식 세트' : '스킬 공격력 35% 증가'
    ,'초대륙의 붕괴 세트':'모든 공격력 35% 증가'
    ,'핀드 베나토르 세트' : '공격 시 25% 속성 추가 데미지 물리 크리티컬 히트 +5% 마법 크리티컬 히트 +5%'
    ,'게슈펜스트의 환각 세트' : '모든 공격력 35% 증가'
    ,'센츄리온 히어로 세트' : '공격 시 데미지 55% 증가'
    ,'고대전쟁의 여신 세트' : '모든 직업 85 레벨 스킬 Lv +2 크리티컬 공격 시 데미지 35% 증가 상태이상 데미지 35% 증가'
    ,'찬란한 명예의 상징 세트' : '크리티컬 공격 시 데미지 35% 증가'
    ,'마계의 정중한 신사 세트' : '힘 10%, 지능 10% 증가 공격 시 데미지 33% 증가'
    ,'오기일의 꽃 세트' :'힘 12%, 지능 12% 증가 모든 공격력 20% 증가'
    ,'풀 플레이트 아머 세트' : '해당 장비의 슈퍼아머 상태일 때 공격 시 40% 추가 데미지'
    ,'마력의 소용돌이 세트' :  '공격 시 35% 추가데미지 모든 직업 50 ~ 75 레벨 모든 스킬 Lv +2 (특성 스킬 제외) 모든 직업 85 레벨 모든 스킬 Lv +1 (특성 스킬 제외)'
    ,'인피니티 레퀴엠 세트' : '모든 직업 60 ~ 70 레벨 모든 스킬 Lv +1 (특성 스킬 제외) 스킬 시전 시 10% 확률로 30초동안 무한의 진혼곡 버프가 발생하여 자신을 포함한 모든 파티원들의 물리, 마법, 독립 공격력 15% 증가 (장착 해제 시 옵션이 해제됩니다.) 스킬 쿨타임 10% 감소 공격 시 20% 추가 데미지'
    ,'웨슬리의 전술 세트' :  '공격 시 40% 추가데미지'
    ,'암살자의 마음가짐 세트' : '힘 12%, 지능 12% 증가 1초 동안 서있거나 걷기 상태일 때 5초동안 자신에게 카모플라쥬 버프 시전 공격 시 35% 추가 데미지'
    ,'무음 카멜레온 세트' : '해당 장비의 카모플라쥬 옵션이 발동되면 지속시간 동안 공격 시 15% 추가데미지 (최대 2 중첩)'
}
