
세트아이템_2 = {
    '바이라바의 계승자' : '공격 시 데미지 증가량 12% 추가 증가 공격 시 크리티컬 데미지 증가량 12% 추가 증가'
}

세트아이템_3 ={
    '바이라바의 계승자' : '힘, 지능 12% 증가 장착 시 이동속도 +7%, 공격속도 +7%, 캐스팅속도 +10% 증가(장착 해제 시 옵션이 해제됩니다.)'
    ,'헤블론의 군주 세트' : '헤블론의 어둠의 영광 : 스킬 공격력 20% 증가'
    ,'오감의 황홀경 세트' :  "크리티컬 공격 시 데미지 20% 증가 공격 시 데미지 20% 증가\
                            공격 시 30초동안 공격속도 10% 증가\
                            캐스팅시 30초동안 캐스팅속도 12% 증가\
                            대쉬 시 30초동안 이동속도 10% 증가\
                            모든 속성 저항 +30"
    ,'하늘의 여행자 세트' :  '공격 시 30% 추가 데미지'
    ,'타락의 칠죄종 세트' : '크리티컬 공격 시 데미지 증가량 25%'
    ,'나가라자의 탐식 세트' : '모든 공격력 25% 증가'
    ,'초대륙의 붕괴 세트' : '공격 시 22% 추가 데미지'
    ,'핀드 베나토르 세트' : '물리, 마법, 독립 공격력 10% 증가'
    ,'게슈펜스트의 환각 세트':'힘 20%, 지능 20% 증가'
    ,'센츄리온 히어로 세트' : '공격 시 25% 추가 데미지'
    ,'고대전쟁의 여신 세트' : '모든 직업 50 레벨 스킬 Lv +3 모든 공격력 22% 증가'
    ,'찬란한 명예의 상징 세트' : '공격 시 15% 추가 데미지'
    ,'마계의 정중한 신사 세트' : '공격 시 데미지 증가량 20% 추가 증가 힘 5%, 지능 5% 증가'
    ,'오기일의 꽃 세트' : '물리, 마법, 독립 공격력 10% 증가'
    ,'정제된 이계의 마석 세트' : '공격 시 20% 추가데미지 모든 속성 강화 +18 물리 크리티컬 히트 +12% 마법 크리티컬 히트 +12% HP MAX +880 모든 속성 저항 --23'
    ,'얼음 공주의 숨결 세트' : '공격 시 18% 추가 데미지 500px 범위 내에 있는 적에게 빙결 오라 생성 수속성강화 +50 수속성저항 +35'
    ,'슈퍼 스타 세트' : '공격 시 25% 추가 데미지'
    ,'무언의 건설자 세트' : '스킬 시전 시 60초동안 무색 큐브 조각 2개를 소모하여 모든 공격력 10% 증가'
    ,'황야의 로맨티스트 세트' : '공격 시 5% 추가 데미지'
    ,'질병의 근원 세트' : '500px 범위 내에 모든 적의 모든 상태이상 내성을 50 감소시키는 오라가 발생'
    ,'파묻힌 비명의 영혼 세트' : '공격 시 3% 확률로 10초동안 맞은 적의 250px 범위 내의 모든 적의 방어력을 10% 감소 모든 속성 강화 +10'
    ,'고대 왕국의 기사 세트' : '공격 시 5% 확률로 20초동안 힘 100, 지능 100 증가 피격 시 300px 범위 내에 있는 모든 적을 3초동안 기절상태로 만듦 HP MAX +1200 히트리커버리 +250'
    ,'그라시아 가문의 상징 세트' :'장착 시 60초마다 흰색 큐브 조각 1개를 소모하여 60초동안 무기에 명속성 부여 힘 +50 지능 +50 명속성강화 +10'
    ,'저주받은 해신의 분노 세트' : '장착 시 60초마다 청색 큐브 조각 1개를 소모하여 60초동안 무기에 수속성 부여 공격 시 3% 추가데미지 수속성강화 +12'
    ,'애끓는 비탄 세트' : '장착 시 20초마다 흑색 큐브 조각 1개를 소모하여 15초동안 통곡의 비탄 효과 발생 통곡의 비탄 효과 상태일 때 공격 시 데미지 20% 증가'
    ,'무신의 정수가 담긴 세트' : '모든 속성 강화 +20'
    ,'거대한 형상의 기운 세트' : '스킬 쿨타임 10% 감소 스킬 공격력 10% 증가 공격 시 5% 확률로 30초 동안 힘, 지능 10% 증가(쿨타임 30초) MP소모량 20% 증가'
    }


세트아이템_5 ={
    '타락의 칠죄종 세트' : '스킬 공격력 35% 증가'
    ,'나가라자의 탐식 세트' : '스킬 공격력 35% 증가'
    ,'초대륙의 붕괴 세트':'모든 공격력 35% 증가'
    ,'핀드 베나토르 세트' : '공격 시 25% 속성 추가 데미지 물리 크리티컬 히트 +5% 마법 크리티컬 히트 +5%'
    ,'게슈펜스트의 환각 세트' : '모든 공격력 35% 증가'
    ,'센츄리온 히어로 세트' : '공격 시 데미지 55% 증가'
    ,'고대전쟁의 여신 세트' : '모든 직업 85 레벨 스킬 Lv +2 크리티컬 공격 시 데미지 35% 증가 상태이상 데미지 35% 증가'
    ,'찬란한 명예의 상징 세트' : '크리티컬 공격 시 데미지 35% 증가'
    ,'마계의 정중한 신사 세트' : '힘 10%, 지능 10% 증가 공격 시 데미지 33% 증가'
    ,'오기일의 꽃 세트' :'힘 12%, 지능 12% 증가 모든 공격력 20% 증가'
    ,'풀 플레이트 아머 세트' : '해당 장비의 슈퍼아머 상태일 때 공격 시 40% 추가 데미지'
    ,'마력의 소용돌이 세트' :  '공격 시 35% 추가데미지 모든 직업 50 ~ 75 레벨 모든 스킬 Lv +2 (특성 스킬 제외) 모든 직업 85 레벨 모든 스킬 Lv +1 (특성 스킬 제외)'
    ,'인피니티 레퀴엠 세트' : '모든 직업 60 ~ 70 레벨 모든 스킬 Lv +1 (특성 스킬 제외) 스킬 시전 시 10% 확률로 30초동안 무한의 진혼곡 버프가 발생하여 자신을 포함한 모든 파티원들의 물리, 마법, 독립 공격력 15% 증가 (장착 해제 시 옵션이 해제됩니다.) 스킬 쿨타임 10% 감소 공격 시 20% 추가 데미지'
    ,'웨슬리의 전술 세트' :  '공격 시 40% 추가데미지'
    ,'암살자의 마음가짐 세트' : '힘 12%, 지능 12% 증가 1초 동안 서있거나 걷기 상태일 때 5초동안 자신에게 카모플라쥬 버프 시전 공격 시 35% 추가 데미지'
    ,'무음 카멜레온 세트' : '해당 장비의 카모플라쥬 옵션이 발동되면 지속시간 동안 공격 시 15% 추가데미지 (최대 2 중첩)'
    ,'아이실드 러데이니언 세트' : '힘 5%, 지능 5% 증가 대쉬 시 60초동안 물리, 마법, 독립 공격력 40%, 공격속도 10%, 이동속도 10%, 캐스팅속도 15% 증가'
    ,'자연의 수호자 세트' : '공격 시 45% 추가 데미지'
    ,'서브마린 볼케이노 세트' : '공격 시 8% 화속성 추가 데미지'
    ,'거미 여왕의 숨결 세트' : '중독 데미지 30% 증가 감전 데미지 30% 증가 출혈 데미지 30% 증가 화상 데미지 30% 증가 공격 시 20초 동안 적의 모든상태변화 내성 25 감소 물리 공격력, 마법 공격력, 독립 공격력 12% 증가 공격 시 데미지 45% 증가 상태이상의 적을 공격 시 5% 확률로 적의 HP 30% 감소'
    ,'금지된 계약 세트' : 'HP가 100% 이하일 때 물리, 마법 공격력 30%, 독립 공격력 30% 증가 크리티컬 공격 시 데미지 20% 증가 HP가 40% 이하일 때 공격 시 HP, MP 60% 회복 HP 50% 이하일 때 피격 시 2초동안 무적'
    ,'미지의 다크홀 세트' : '공격 시 5% 확률로 자신을 15초동안 암흑상태로 만듦 (쿨타임 3초) 자신이 암흑 상태일 때 공격 시 50% 추가 데미지'
    ,'엘리멘탈 드롭퍼 세트' : '500px 범위 내 적이 있을 경우 모든속성 강화 50 증가 400px 범위 내 적이 있을 경우 지능 400 증가 300px 범위 내 적이 있을 경우 스킬 공격력 18% 증가 300px 범위 내 적이 있을 때 캐스팅 시전 시 2초동안 슈퍼아머 시전 (쿨타임 2초) 300px 범위 내 있는 적들의 마법 방어력 20% 감소 오라 발생'
    ,'불타오르는 마력 세트' : '스킬 MP 소모량 10% 증가 피격 시 MP 2% 감소 (쿨타임 1초) 피격 시 받는 데미지 10% 감소 적이 죽으면 MP 1% 회복 장착 시 30초마다 30초동안 지능 18% 증가, MP 3% 감소 MP MAX +1100 마법 공격력 +550 독립 공격력 +550'
    ,'다크 고스 세트' : '30초마다 파티원에게 30초동안 암속성 부여 암속성 저항이 30 이상일 때 -공격 시 10% 속성 추가데미지 -암속성 강화 15 증가 암속성 저항이 55 이상일 때\
-공격 시 10% 확률로 500px 범위내에 있는 모든 적에게 다크 익스플로전 시전 암속성 저항이 75 이상일 때 -암속성 저항력 50 증가, 암속성 저항 15당 500px 범위 내의 적의 암속성 저항력 3 감소'
    ,'황야의 로맨티스트 세트' : '1차 각성 패시브 스킬 Lv+1 1차 각성 액티브 스킬 Lv+2 외전캐릭터 50레벨 액티브 스킬 Lv+2 외전캐릭터 50레벨 패시브 스킬 Lv+2'
    ,'질병의 근원 세트' : '상태이상인 적 공격 시 10초 동안 적의 방어력 10% 감소'
    ,'파묻힌 비명의 영혼 세트' : '장착 시 300px 범위 내에 있는 모든 적의 모든 속성 저항 25 감소'
    ,'고대 왕국의 기사 세트' : '장착 시 힘 5%, 지능 5% 증가 히트리커버리 +250 기절 내성 +30'
    ,'그라시아 가문의 상징 세트' : '공격 시 10% 확률로 적에게 라이트 익스플로젼 발생 명속성강화 +12'
    ,'저주받은 해신의 분노 세트' : '공격 시 17% 추가데미지 장착시 10초마다 500px 범위내에 가장 가까운 적을 10초동안 저주상태로 만듦. 공격 시 5초동안 적을 저주 상태로 만듦\
                                HP MAX +250 MP MAX +250 공격속도 +3% 이동속도 +2% 캐스트속도 +3%'
    ,'애끓는 비탄 세트' : ""
    ,'무신의 정수가 담긴 세트' : '크리티컬 공격 시 데미지 15% 증가(장착 해제 시 옵션이 해제됩니다. 크리티컬 증가 데미지 관련 옵션은 가장 높은 수치만 적용됩니다.) 물리 크리티컬 히트 +3% 마법 크리티컬 히트 +3%'
}


세트아이템_6 = {
    '황야의 로맨티스트 세트': '공격 시 12% 추가 데미지'
    ,'질병의 근원 세트' : '상태이상인 적 공격 시 5% 추가 데미지 2초마다 300px 범위내에 모든 적을 10초동안 저주, 화상, 감전 상태이상으로 만듦'
    ,'파묻힌 비명의 영혼 세트' : '장착 시 300px 범위 내에 있는 파티원들의 속성 강화를 10 증가시키는 오라 발생'
    ,'고대 왕국의 기사 세트' : '장착 시 힘 3%, 지능 3% 증가 히트리커버리 +250 기절 내성 +30'
    ,'그라시아 가문의 상징 세트' : '공격 시 10% 확률로 적에게 라이트 익스플로젼 발생 공격 시 6% 명속성 추가 데미지'
    ,'저주받은 해신의 분노 세트' : '공격 시 5% 확률로 자신의 주변 500px 범위내에 저주받은 해신의 격노 발생'
    ,'애끓는 비탄 세트' :  '피격 시 받는 데미지 20% 감소 500px 범위내에 적이 존재하면 500px 범위내에 있는 파티원들에게 15초동안 슈퍼아머 시전'
    ,'무신의 정수가 담긴 세트' : '공격 시 데미지 20% 증가(증가 데미지 관련 옵션은 가장 높은 수치만 적용됩니다. 크리티컬 증가 데미지는 제외)'
}